# SaveOptions Class

---
This class contains options available for saving a document to disk.
SystemObject Autodesk.Revit.DBSaveOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SaveOptions : IDisposable

    Public Class SaveOptions
    	Implements IDisposable

    public ref class SaveOptions : IDisposable

    type SaveOptions =
        class
            interface IDisposable
        end
The SaveOptions type exposes the following members.
| Name| Description
---|---|---
| SaveOptions|  Default constructor.
Top
| Name| Description
---|---|---
| Compact|  Default is false: let the OS eliminate as much or as little dead data as it wants to. True: force the OS to eliminate all dead data from the file on disk.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| PreviewViewId|  The view id that will be used to generate the preview; this id is not saved to the document's permanent settings.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the SaveOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace